bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY261.xml
                <register caption="Timer/Counter Control Register D" name="TCCR1D" offset="0x46" size="1">
                    <bitfield caption="Fault Protection Interrupt Enable" mask="0x80" name="FPIE1"/>
                    <bitfield caption="Fault Protection Mode Enable" mask="0x40" name="FPEN1"/>
                    <bitfield caption="Fault Protection Noise Canceler" mask="0x20" name="FPNC1"/>
                    <bitfield caption="Fault Protection Edge Select" mask="0x10" name="FPES1"/>
                    <bitfield caption="Fault Protection Analog Comparator Enable" mask="0x08" name="FPAC1"/>
                    <bitfield caption="Fault Protection Interrupt Flag" mask="0x04" name="FPF1"/>
                    <bitfield caption="Waveform Generation Mode Bit" mask="0x03" name="WGM1"
                              values="PULSE_WIDTH_MODU2"/>
                </register>
                <register caption="Timer/Counter1 Control Register E" name="TCCR1E" offset="0x20" size="1">
                    <bitfield caption="Ouput Compare Override Enable Bits" mask="0x3F" name="OC1OE"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT1" offset="0x4E" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="Timer/Counter 1 Register High" name="TC1H" offset="0x45" size="1" mask="0x03"/>
                <register caption="Output Compare Register" name="OCR1A" offset="0x4D" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR1B" offset="0x4C" size="1" mask="0xFF"/>
                <register caption="Output compare register" name="OCR1C" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="Output compare register" name="OCR1D" offset="0x4A" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="OCIE1D: Timer/Counter1 Output Compare Interrupt Enable" mask="0x80"
                              name="OCIE1D"/>
                    <bitfield caption="OCIE1A: Timer/Counter1 Output Compare Interrupt Enable" mask="0x40"
                              name="OCIE1A"/>
                    <bitfield caption="OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable" mask="0x20"
                              name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter1 Output Compare Flag 1D" mask="0x80" name="OCF1D"/>
                    <bitfield caption="Timer/Counter1 Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
                </register>
                <register caption="Timer/Counter 1 Dead Time Value" name="DT1" offset="0x44" size="1">
                    <bitfield caption="" mask="0xF0" name="DT1H"/>
                    <bitfield caption="" mask="0x0F" name="DT1L"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="MISC_2BIT_SCALE">
                <value caption="1x" name="VAL_0x00" value="0x00"/>
                <value caption="2x" name="VAL_0x01" value="0x01"/>
                <value caption="4x" name="VAL_0x02" value="0x02"/>
                <value caption="8x" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_4BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/2" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/4" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/8" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/16" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/32" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/64" name="VAL_0x07" value="0x07"/>
                <value caption="Running, CLK/128" name="VAL_0x08" value="0x08"/>
                <value caption="Running, CLK/256" name="VAL_0x09" value="0x09"/>
                <value caption="Running, CLK/512" name="VAL_0x0A" value="0x0A"/>
                <value caption="Running, CLK/1024" name="VAL_0x0B" value="0x0B"/>
                <value caption="Running, CLK/2048" name="VAL_0x0C" value="0x0C"/>
                <value caption="Running, CLK/4096" name="VAL_0x0D" value="0x0D"/>
                <value caption="Running, CLK/8192" name="VAL_0x0E" value="0x0E"/>
                <value caption="Running, CLK/16384" name="VAL_0x0F" value="0x0F"/>
            </value-group>
            <value-group caption="" name="PULSE_WIDTH_MODU2">
                <value caption="Fast PWM (NB! PWMx must be set!)" name="VAL_0x00" value="0x00"/>
                <value caption="Phase and Frequency Correct PWM" name="VAL_0x01" value="0x01"/>
                <value caption="PWM6/Single-slope" name="VAL_0x02" value="0x02"/>
                <value caption="PWM6/Dual-slope" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1"
                          ocd-rw="R">
                    <bitfield caption="Clear temporary page buffer" mask="0x10" name="CTPB"/>
                    <bitfield caption="Read fuse and lock bits" mask="0x08" name="RFLB"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
