bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY261.xml
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC_20">
            <pin pad="PB0" position="1"/>
            <pin pad="PB1" position="2"/>
            <pin pad="PB2" position="3"/>
            <pin pad="PB3" position="4"/>
            <pin pad="VCC" position="5"/>
            <pin pad="GND" position="6"/>
            <pin pad="PB4" position="7"/>
            <pin pad="PB5" position="8"/>
            <pin pad="PB6" position="9"/>
            <pin pad="PB7" position="10"/>
            <pin pad="PA7" position="11"/>
            <pin pad="PA6" position="12"/>
            <pin pad="PA5" position="13"/>
            <pin pad="PA4" position="14"/>
            <pin pad="AVCC" position="15"/>
            <pin pad="AGND" position="16"/>
            <pin pad="PA3" position="17"/>
            <pin pad="PA2" position="18"/>
            <pin pad="PA1" position="19"/>
            <pin pad="PA0" position="20"/>
        </pinout>
        <pinout name="QFN_32">
            <pin pad="PB3" position="2"/>
            <pin pad="VCC" position="4"/>
            <pin pad="GND" position="5"/>
            <pin pad="PB4" position="7"/>
            <pin pad="PB5" position="8"/>
            <pin pad="PB6" position="10"/>
            <pin pad="PB7" position="11"/>
            <pin pad="PA7" position="13"/>
            <pin pad="PA6" position="14"/>
            <pin pad="PA5" position="15"/>
            <pin pad="PA4" position="17"/>
            <pin pad="AVCC" position="18"/>
            <pin pad="AGND" position="21"/>
            <pin pad="PA3" position="22"/>
            <pin pad="PA2" position="23"/>
            <pin pad="PA1" position="25"/>
            <pin pad="PA0" position="26"/>
            <pin pad="PB0" position="30"/>
            <pin pad="PB1" position="31"/>
            <pin pad="PB2" position="32"/>
        </pinout>
    </pinouts>
</target-description-file>
